       Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 16, 32, 32]             432
       BatchNorm2d-2           [-1, 16, 32, 32]              32
              ReLU-3           [-1, 16, 32, 32]               0
            Conv2d-4           [-1, 32, 32, 32]           4,608
       BatchNorm2d-5           [-1, 32, 32, 32]              64
              ReLU-6           [-1, 32, 32, 32]               0
            Conv2d-7           [-1, 32, 32, 32]           9,216
            Conv2d-8           [-1, 32, 32, 32]             512
        BasicBlock-9           [-1, 32, 32, 32]               0
      BatchNorm2d-10           [-1, 32, 32, 32]              64
             ReLU-11           [-1, 32, 32, 32]               0
           Conv2d-12           [-1, 32, 32, 32]           9,216
      BatchNorm2d-13           [-1, 32, 32, 32]              64
             ReLU-14           [-1, 32, 32, 32]               0
           Conv2d-15           [-1, 32, 32, 32]           9,216
       BasicBlock-16           [-1, 32, 32, 32]               0
     NetworkBlock-17           [-1, 32, 32, 32]               0
      BatchNorm2d-18           [-1, 32, 32, 32]              64
             ReLU-19           [-1, 32, 32, 32]               0
           Conv2d-20           [-1, 64, 16, 16]          18,432
      BatchNorm2d-21           [-1, 64, 16, 16]             128
             ReLU-22           [-1, 64, 16, 16]               0
           Conv2d-23           [-1, 64, 16, 16]          36,864
           Conv2d-24           [-1, 64, 16, 16]           2,048
       BasicBlock-25           [-1, 64, 16, 16]               0
      BatchNorm2d-26           [-1, 64, 16, 16]             128
             ReLU-27           [-1, 64, 16, 16]               0
           Conv2d-28           [-1, 64, 16, 16]          36,864
      BatchNorm2d-29           [-1, 64, 16, 16]             128
             ReLU-30           [-1, 64, 16, 16]               0
           Conv2d-31           [-1, 64, 16, 16]          36,864
       BasicBlock-32           [-1, 64, 16, 16]               0
     NetworkBlock-33           [-1, 64, 16, 16]               0
      BatchNorm2d-34           [-1, 64, 16, 16]             128
             ReLU-35           [-1, 64, 16, 16]               0
           Conv2d-36            [-1, 128, 8, 8]          73,728
      BatchNorm2d-37            [-1, 128, 8, 8]             256
             ReLU-38            [-1, 128, 8, 8]               0
           Conv2d-39            [-1, 128, 8, 8]         147,456
           Conv2d-40            [-1, 128, 8, 8]           8,192
       BasicBlock-41            [-1, 128, 8, 8]               0
      BatchNorm2d-42            [-1, 128, 8, 8]             256
             ReLU-43            [-1, 128, 8, 8]               0
           Conv2d-44            [-1, 128, 8, 8]         147,456
      BatchNorm2d-45            [-1, 128, 8, 8]             256
             ReLU-46            [-1, 128, 8, 8]               0
           Conv2d-47            [-1, 128, 8, 8]         147,456
       BasicBlock-48            [-1, 128, 8, 8]               0
     NetworkBlock-49            [-1, 128, 8, 8]               0
      BatchNorm2d-50            [-1, 128, 8, 8]             256
             ReLU-51            [-1, 128, 8, 8]               0
           Linear-52                   [-1, 10]           1,290
================================================================
Total params: 691,674
Trainable params: 691,674
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 7.38
Params size (MB): 2.64
Estimated Total Size (MB): 10.03
