| Wide-Resnet 16x2
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 16, 32, 32]             432
       BatchNorm2d-2           [-1, 16, 32, 32]              32
            Conv2d-3           [-1, 32, 32, 32]           4,608
           Dropout-4           [-1, 32, 32, 32]               0
       BatchNorm2d-5           [-1, 32, 32, 32]              64
            Conv2d-6           [-1, 32, 32, 32]           9,216
            Conv2d-7           [-1, 32, 32, 32]             512
        wide_basic-8           [-1, 32, 32, 32]               0
       BatchNorm2d-9           [-1, 32, 32, 32]              64
           Conv2d-10           [-1, 32, 32, 32]           9,216
          Dropout-11           [-1, 32, 32, 32]               0
      BatchNorm2d-12           [-1, 32, 32, 32]              64
           Conv2d-13           [-1, 32, 32, 32]           9,216
       wide_basic-14           [-1, 32, 32, 32]               0
      BatchNorm2d-15           [-1, 32, 32, 32]              64
           Conv2d-16           [-1, 64, 16, 16]          18,432
          Dropout-17           [-1, 64, 16, 16]               0
      BatchNorm2d-18           [-1, 64, 16, 16]             128
           Conv2d-19           [-1, 64, 16, 16]          36,864
           Conv2d-20           [-1, 64, 16, 16]           2,048
       wide_basic-21           [-1, 64, 16, 16]               0
      BatchNorm2d-22           [-1, 64, 16, 16]             128
           Conv2d-23           [-1, 64, 16, 16]          36,864
          Dropout-24           [-1, 64, 16, 16]               0
      BatchNorm2d-25           [-1, 64, 16, 16]             128
           Conv2d-26           [-1, 64, 16, 16]          36,864
       wide_basic-27           [-1, 64, 16, 16]               0
      BatchNorm2d-28           [-1, 64, 16, 16]             128
           Conv2d-29            [-1, 128, 8, 8]          73,728
          Dropout-30            [-1, 128, 8, 8]               0
      BatchNorm2d-31            [-1, 128, 8, 8]             256
           Conv2d-32            [-1, 128, 8, 8]         147,456
           Conv2d-33            [-1, 128, 8, 8]           8,192
       wide_basic-34            [-1, 128, 8, 8]               0
      BatchNorm2d-35            [-1, 128, 8, 8]             256
           Conv2d-36            [-1, 128, 8, 8]         147,456
          Dropout-37            [-1, 128, 8, 8]               0
      BatchNorm2d-38            [-1, 128, 8, 8]             256
           Conv2d-39            [-1, 128, 8, 8]         147,456
       wide_basic-40            [-1, 128, 8, 8]               0
      BatchNorm2d-41            [-1, 128, 8, 8]             256
           Linear-42                   [-1, 10]           1,290
================================================================
Total params: 691,674
Trainable params: 691,674
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 5.94
Params size (MB): 2.64
Estimated Total Size (MB): 8.59
----------------------------------------------------------------
